# Ответы к задачам главы "Арифметические операции"

# Задача 1. Сложение
# Сложите числа 15 и 38. Выведите результат.
print(15 + 38)

# Задача 2. Вычитание
# Вычтите из 100 число 45. Выведите результат.
print(100 - 45)

# Задача 3. Умножение
# Умножьте 7 на 8.
print(7 * 8)

# Задача 4. Деление
# Разделите 50 на 4. Какой тип данных получился?
print(50 / 4) # 12.5 (float)

# Задача 5. Целочисленное деление
# Сколько раз число 4 помещается в 50 целиком? Используйте `//`.
print(50 // 4) # 12

# Задача 6. Остаток от деления
# Чему равен остаток от деления 20 на 3? Используйте `%`.
print(20 % 3) # 2

# Задача 7. Возведение в степень
# Возведите 2 в степень 10 (2 в 10-й степени).
print(2 ** 10) # 1024

# Задача 8. Приоритет операций
# Вычислите `2 + 2 * 2`. Затем `(2 + 2) * 2`. Сравните результаты.
print(2 + 2 * 2)   # 6
print((2 + 2) * 2) # 8

# Задача 9. Периметр квадрата
# Сторона квадрата `a = 5`. Найдите периметр `P = 4 * a`.
a = 5
print(4 * a)

# Задача 10. Площадь прямоугольника
# Даны стороны `a = 10`, `b = 20`. Найдите площадь `S = a * b`.
a = 10
b = 20
print(a * b)

# Задача 11. Секунды в часе
# Сколько секунд в одном часе? (60 секунд * 60 минут).
print(60 * 60)

# Задача 12. Среднее арифметическое
# Даны числа 10, 20, 30. Найдите их среднее ((a+b+c)/3).
print((10 + 20 + 30) / 3)

# Задача 13. Последняя цифра
# Дано число 12345. Найдите его последнюю цифру, используя оператор `% 10`.
n = 12345
print(n % 10) # 5

# Задача 14. Следующее четное
# Дано четное число `n = 10`. Получите следующее четное число (+2).
n = 10
print(n + 2)

# Задача 15. Отрицательные числа
# Умножьте -5 на -5. Проверьте знак результата.
print(-5 * -5) # 25
